violence_texts = {
    "👊 фізичне": "Фізичне насильство включає удари, штовхання, побиття. Важливо звертатися за допомогою та не залишатися наодинці.",
    "🧠 психологічне": "Психологічне насильство — приниження, погрози, контроль, маніпуляції. Пошук підтримки дуже важливий.",
    "💰 економічне": "Економічне насильство — обмеження доступу до грошей, майна, ресурсів. Шукайте поради у спеціалістів.",
    "🔞 сексуальне": "Сексуальне насильство — примус до сексуальних дій без згоди. Звертайтесь до правоохоронних органів і гарячих ліній."
}