violence_texts = {
    "👊 фізичне": """👊 Фізичне насильство – умисне нанесення побоїв, тілесних ушкоджень, що може призвести або призвело до травмування, порушення фізичного чи психічного здоров’я, заподіяння шкоди честі та гідності, в окремих випадках, до смерті.
    
    ❗Ви зіткнулися із фізичним насильством, якщо вас:
    * Б’ють чи штовхають;
    * Не випускають з власного дому або не пускають до нього;
    * Погрожують позбавити життя чи навмисно створюють ситуації, які можуть становити загрозу здоров’ю та безпеці;
    * Змушують до вживання алкоголю чи наркотиків;
    * Позбавляють їжі, перешкоджають відпочинку чи сну;
    * Проти волі переміщують у межах однієї держави або за кордон із застосуванням сили, погроз чи обману.""",

    "🧠 психологічне": """🧠 Психологічне насильство – вплив на психіку іншої особи шляхом словесних образ або погроз, переслідування, залякування, якими навмисно спричиняється емоційна невпевненість, нездатність захистити себе та завдається шкода психічному здоров’ю.
    
    ❗Ви зіткнулися із психологічним насильством, якщо вас:
    * Систематично принижують і вами маніпулюють;
    * Ображають словесно або негативним жестами, мімікою;
    * Переслідують, постійно контролюють, погрожують;
    * Зневажають та ігнорують бажання, думки, почуття, безпідставно критикують;
    * Позбавляють права на захист честі та гідності;
    * Шантажують;
    * Ігнорують чи дискримінують через ваші переконання, віросповідання, національну, расову приналежність чи походження.""",

    "💰 економічне": """💰 Економічне насильство – умисне позбавлення однією особою або групою осіб іншої людини або групи людей житла, їжі, одягу та іншого майна чи коштів, на які постраждалі мають передбачене законом право.
    
    ❗Ви зіткнулися з економічним насильством, якщо вас:
    * Обмежують у доступі до власних коштів чи забороняють використовувати власні кошти так, як ви вважаєте за потрібне;
    * Пошкоджують ваше майно;
    * Позбавляють або перешкоджають у доступі до їжі, житла, майна;
    * Обмежують у можливості працевлаштування, забороняють навчатися чи працювати;
    * Примушують до жебрацтва;
    * Шантажують.""",

    "🔞 сексуальне": """🔞Сексуальне насильство – протиправне посягання однієї особи або групи осіб на статеву недоторканість іншої людини, а також дії сексуального характеру щодо неповнолітнього/ої.

    ❗Ви зіткнулися із сексуальним насильством, якщо вас:
    * Зґвалтували;
    * Примушують до небажаних сексуальних контактів;
    * Торкаються до інтимних частин вашого тіла проти вашої волі;
    * Примушують до сексу з іншими людьми;
    * Примушують до збочених форм сексуальних стосунків;
    * Примушують займатися порноіндустрією чи секс-бізнесом;
    * Примушують до вагітності або аборту;
    * Примушують до спостереження за статевим контактом кривдника."""
}