from keyboards.help_links import help_links

def get_help_text():
    return (
        "Якщо ти в небезпеці — важливо не залишатися наодинці!\n\n"
        "📞 112 — екстрена допомога\n"
        "📞 102 — Національна поліція\n"
        "📞 15-47 — гаряча лінія з протидії домашньому насильству\n"
        "📞 0 800 500 335 — безкоштовна національна гаряча лінія\n\n"
        "Нижче — корисні посилання 👇"
    )

async def show_help(update, context):
    await update.message.reply_text(
        get_help_text(),               # ← текст
        reply_markup=help_links        # ← inline-кнопки ПІД текстом
    )