"""Створіть клас під назвою Counter і зробіть його підкласом класу Thread у модулі Threading. 
Зробіть клас з двома глобальними змінними: однією з них буде counter, встановленим на 0, а іншою — rounds, встановленим на 100.000. 
Тепер реалізуйте метод run(), нехай він включає простий цикл for, який перебирає раунди (наприклад, 100.000 разів) і кожного разу 
збільшує значення лічильника на 1. Створіть 2 екземпляри потоку та запустіть їх, потім об'єднайте їх і перевірте результат лічильника"""

import threading

counter = 0                         # глобальні змінні
rounds = 100_000

class Counter(threading.Thread):
    def run(self):
        global counter
        for _ in range(rounds):
            counter += 1

if __name__ == "__main__":
    
    t1 = Counter()                  # створюємо два потоки
    t2 = Counter()

    t1.start()                      # запускаємо обидва
    t2.start()
    
    t1.join()                       # завершення
    t2.join()

    print("Результат:", counter)